[
    {
      "id":1001210,
      "name":"Supervisory Trainning",
      "description":" We use a proven model as a guideline for building effective and application-based supervisor training that addresses customers' individual needs Driven. conducts an assessment of each situation, depending on the complexity of each organization's training need. focused on the specific audience, and chooses the appropriate tools and techniques that will make the training 'stick' and be able to be used immediately on the job",
      "price":500,
      "slogan":" We are leading provider of supervisor training. We work with organizations to create a customized training solution, and we deliver the courses nationwide in a variety of formats",
      "image":"https://images.pexels.com/photos/3184611/pexels-photo-3184611.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
    },
    {
      "id":2092512,
      "name":"Management Trainning",
      "description":"Our training is interactive and dynamic because it incorporates group discussions and activities. It also allows participants to gain knowledge and skills to apply when returning to the workplace after training.We work with each organization to conduct an assessment in order to determine the training needs.We work closely with the organization to design the appropriate training solution, focused on the specific audience. We also choose the appropriate techniques and tools that will make the training resonate well",
      "price":420,
      "slogan":"We are leading provider of performance management training, and we offer a variety of customized training courses.",
      "image":"https://images.pexels.com/photos/7793702/pexels-photo-7793702.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
    },
    {
      "id":3912034,
      "name":"Leadership Development Training",
      "description":"Our leadership development training helps move leaders from the traditional role of judging and evaluating, to one of ensuring accountability through creating a supportive and motivating work environment. ERC also delivers leadership assessments and leadership development plans and can blend these services with training.We deliver leadership development series in a variety of methods, including in webinar format, at our training center in Ohio through Supervisory Series and Mid-Level Leader Series, at your organization, and an option to train the trainers at your company. Check out the details below to learn more about our delivery methods",
      "price":700,
      "slogan":"We offer a variety of leadership development training programs at all levels of the organization, from executive to mid-level manager to first time managers and supervisors",
      "image":"https://images.pexels.com/photos/7255389/pexels-photo-7255389.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
    },
    {
      "id":4680221,
      "name":"Lean Training Courses",
      "description":"Lean Office improves your administration processes substantially and quickly.Lean 5S training eliminates waste, improves processes, and reduces inefficiencies.Six Sigma training consists of two phases: Yellow Belt certification and Green Belt certification.We delivers Lean training in webinar format or at your organization for groups of employees. We work with you to customize the training solution to make sure it is the best possible experience for your employees and meets your goals",
      "price":640,
      "slogan":"Lean is an overarching concept to describe various systematic methods with the goal of establishing a more efficient, less wasteful process of operations that leads to increased value for customers",
      "image":"https://images.pexels.com/photos/3184465/pexels-photo-3184465.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
    },
    {
      "id":5943001,
      "name":"Customer Service Pro Series Training",
      "description":"This highly engaging 4-part training series provides participants with a solid foundation of customer service skills. Learn the basics of providing great customer service and how the nuts and bolts of communication can take your service to new heights. Tap into the best practices for providing unparalleled customer service via the telephone and email.Learn the six keys to providing proactive customer service and how to identify what’s in your circle of influence. Identify your customer’s “pain points”, how to master the service recovery model, and how to conquer the Hostility Curve when customers are dissatisfied",
      "price":800,
      "slogan":"Become the customer service professional you’re destined to be with Customer Service Pro Series training",
      "image":"https://images.pexels.com/photos/8867434/pexels-photo-8867434.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
    },
    {
      "id":6835002,
      "name":"Microsoft Office Training Courses",
      "description":"Enroll in a Microsoft Office training course to help increase productivity, collaboration, and understanding of technology updates throughout your organization. Your organization can take a specific Microsoft course below or focus on understanding Microsoft Office as a whole.This course is for beginner users to learn tips to find familiar commands easily and discover powerful new features, such as SmartArt, Quick Parts, keyboard shortcuts and customizing the ribbon and quick access toolbar.Participants will learn: Solve issues such as default paragraph spacing in Word Create Excel tables that calculate columns without writing formulas Insert and edit video on a PowerPoint slide",
      "price":355,
      "slogan":"We offer Microsoft Office training for many programs within the Microsoft suite.",
      "image":"https://activatewindows7.com/wp-content/uploads/2019/12/Microsoft-Office-Free-Download-and-Activate.jpg"
    },
    {
      "id":7100265,
      "name":"Basic Hydraulic Troubleshooting Training",
      "description":"There is also emphasis on preventive maintenance that will show how to reduce the amount of troubleshooting required. Students will learn the proper steps to quickly analyze and pinpoint where a problem is centered and how to fix it.The Hydraulics course was developed with the idea that hydraulic systems are best maintained by those who understand the physical principles that apply to industrial hydraulics. The principles of industrial hydraulics will be customized so that they are applicable to your equipment",
      "price":790,
      "slogan":"he Basic Hydraulic Troubleshooting training course is designed to train people to diagnose problems. This course also covers the proper installation of components and fluid conductors",
      "image":"https://www.fiixsoftware.com/wp-content/uploads/2019/03/Blog-Card_Troubleshooting-for-maintenance.png"
    },
    {
      "id":8256110,
      "name":"Becoming a Trusted Advisor Training",
      "description":"Customers—whether internal or external—not only want to rely on someone’s knowledge for help and assistance, but they also want to be able to count on their trust, support, encouragement, insight, and understanding.In this insightful, meaningful, and practical workshop, participants will explore how to more effectively communicate, collaborate, and cultivate relationships with customers in order to help those customers achieve individual, team, and/or organizational goals and objectives",
      "price":500,
      "slogan":"There is a vast difference between being an expert on a topic/subject area and being a trusted advisor in that same area",
      "image":"https://images.pexels.com/photos/834863/pexels-photo-834863.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
    },
    {
      "id":9222408,
      "name":"Employment Law Training",
      "description":"Employment Law for HR Professionals: This course addresses basic employment laws HR professionals encounter daily. This seminar is designed to provide managers and supervisors with an overview of relevant employment law considerations and to support a proactive, positive work environment. Presented in an interactive style, this seminar can be customized to specific topic areas desired by the employer",
      "price":350,
      "slogan":"We offer Employment Law training options for both HR audiences and general management/supervisory needs",
      "image":"https://images.pexels.com/photos/618613/pexels-photo-618613.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
    },
    {
      "id":1013772,
      "name":"Statistical Analysis Training",
      "description":"Statistics is the study of the collection, analysis, interpretation, presentation and organization of data. In the business world, it is a way to analyze large amounts of seemingly random data to make better decisions that impact quality, reliability, and predictability",
      "price":560,
      "slogan":"This statistical analysis training course offers a basic understanding of statistics and common analytical tools",
      "image":"https://images.pexels.com/photos/6476254/pexels-photo-6476254.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
    },
    {
      "id":1100212,
      "name":"Team Building Training Courses",
      "description":"The purpose of this team building training is to train the interpersonal aspects of teaming for success. This interactive workshop engages participants in techniques used to become successful and how to develop into synergetic and highly effective teams.We an deliver an experiential team building program for groups looking to improve compatibility, communication skills, and problem solving. These courses can handle any group size, from small groups to over 100 employees. These courses include ropes courses, obstacle courses, and more. All programs begin with an interactive ice breaker in order to generate a positive team dynamic and create a comfortable environment. Each exercise is reinforced to ensure participants leave with applicable skills",
      "price":890,
      "slogan":"Give your leaders the skills to build a purposeful team culture within your organization",
      "image":"https://images.pexels.com/photos/3182812/pexels-photo-3182812.jpeg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
    },
    {
      "id":1001812,
      "name":"Social Media Training",
      "description":"They will discover ways to align the strategy with overall business goals as well as learn how to use social media to influence key stakeholders, both internally and externally.The training will also identify which social channels are appropriate for specific events and/or information, and participants will acquire the confidence to act as brand ambassadors for the company using social media",
      "price":760,
      "slogan":"This social media training course will teach participants how to develop a strategic approach to using the organization's social media platforms.",
      "image":"https://images.pexels.com/photos/6168/hands-woman-laptop-notebook.jpg?auto=compress&cs=tinysrgb&dpr=2&h=650&w=940"
    }
  ]